Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Example 1: The following can be used where the bank account number (12345) must be entered before the user and password:
ru_ru: Пример 1. Если перед вводом имени и пароля нужно ввести номер счёта (12345), можно использовать следующую последовательность:

source: Example 2: The following sequence has been suggested by a user as it should clear the username field first before username and password autotype begins.
ru_ru: Пример 2. Указанная ниже последовательность была предложена одним из пользователей для очистки поля для ввода имени пользователя перед автонабором.

source: Example 2: The following sequence, sent in by a user, clears the username field before username and password autotype begins.
ru_ru: Пример 2. Указанная ниже последовательность была предложена одним из пользователей для очистки поля для ввода имени пользователя перед автонабором.

source: Example 2: The following, sent in by a user, clears the username field before username and password autotype begins.
ru_ru: Пример 2. Указанная ниже последовательность была предложена одним из пользователей для очистки поля для имени пользователя перед автонабором.

source: Example 3: The following sequence, also sent in by a user, toggles a checkbox (e.g., disables keeping you logged in):
ru_ru: Пример 3. Указанная ниже последовательность переключает флажок (например, для отмены запоминания входа на этом компьютере):

source: Example 3: The following sequence, sent in by a user, toggles a checkbox (e.g., disables keeping you logged in):
ru_ru: Пример 3. Указанная ниже последовательность переключает флажок (например, для отмены запоминания входа на этом компьютере):

source: Example: The following can be used where the bank account number (12345) must be entered before the user and password:
ru_ru: Пример. Если перед вводом имени и пароля нужно ввести номер счёта (12345), можно использовать следующую последовательность:

source: Group: A name for grouping (organizing) several related entries
ru_ru: Группа: имя, используемое для группировки (систематизации) связанных элементов;

source: IMPORTANT: If an entry that uses a Password Policy Name is imported and that name is not already in the current receiving database, then the resulting entry in the database will revert to using the database's default Password Policy.
ru_ru: Внимание! если элемент использует «именованную политику», которая отсутствует в текущем контейнере, то импортированному элементу будет назначена «политика по умолчанию».

source: Keyboard Shortcut: Keyboard shortcuts can be assigned to an entry and allow that entry to be immediately selected irrespective of the current display of the database by pressing the appropriate keystrokes.
ru_ru: Комбинация клавиш: элементам контейнера можно назначить комбинации клавиш («горячие клавиши»), которые позволят выбирать их сразу после нажатия такое комбинации, независимо от текущего положения в контейнере.

source: Minimize after AutoType By default, Password Safe minimizes when autotyping.
ru_ru: Свернуть после автонабора По умолчанию, Password Safe сворачивает окно при выполнении автонабора.

source: Minimize after autotype By default, Password Safe minimizes when autotyping.
ru_ru: Свернуть после автонабора По умолчанию, Password Safe сворачивает окно при выполнении автонабора.

source: No change - as is says.
ru_ru: Без изменений — настройки сохранения предыдущих паролей не изменяются.

source: Note: Password Safe will only warn the user when passwords have expired.
ru_ru: Примечание. Password Safe только предупреждает об истечении срока действия пароля.

source: Note: If an entry has been selected due to a Find action, then the menu item "Perform AutoType" (and its shortcut if still defined) will use the information of this entry.
ru_ru: Примечание. Если элемент был выбран в результате выполнения поиска, пункт меню «Автонабор» (и соответствующая комбинация клавиш, если задана) будет использовать данные из этого элемента.

source: Note: After configuring your YubiKey, you must change the database's password to use the YubiKey for authentication as described in Changing Master Passwords
ru_ru: Примечание. Чтобы использовать YubiKey для аутентификации, после проведения настройки необходимо сменить мастер-пароль контейнера. Порядок изменения мастер-пароля описан описан в разделе Изменение мастер-пароля для контейнера.

source: Note: As long as there are some unsaved items, there will be a "*" in the status area at the bottom of the application's window.
ru_ru: Примечание. Когда в контейнере присутствуют несохранённые изменения, в строке статуса отображается символ «*».

source: Note: Be sure to add quotes around your string if required e.g., if your database directory contains spaces, to access a text file in it based on your open database name, you would need the following (with quotes):
ru_ru: Примечание. Не забудьте окружить строки кавычками, если это требуется. Например, если путь к контейнеру содержит пробелы, путь к текстовому файлу в данном каталоге следует писать так (с кавычками):

source: Note: By default, Password Safe will show the database last used, and displays a combination prompt for it.
ru_ru: Примечание. По умолчанию Password Safe отображает последний использованный контейнер и запрашивает для него пароль.

source: Note: By default, passwords are obscured.
ru_ru: Примечание. По умолчанию пароль скрыт.

source: Note: By pressing the Ctrl key down whilst clicking on the AutoType and Run Command labels, variables will not be substituted in the strings before copying to the clipboard.
ru_ru: Примечание. Если при щелчке на метке «Автонабор» или «Выполнить команду» удерживать клавишу Ctrl, то при копировании в буфер обмена не будут подставлены значения переменных.

source: Note: Compare, Export, Import, Merge and Synchronize all produce a report that can be viewed in a dialog and then copied to the clipboard or saved to disk as a text file in the same directory as the database.
ru_ru: Примечание. По окончании сравнения, экспорта, импорта и синхронизации создаётся отчёт, содержимое которого можно просмотреть и скопировать в буфер обмена или сохранить на диск в том же каталоге, где находится контейнер.

source: Note: Details on the format of the exported text file may be found in the "Plain Text Export & Import Format" section.
ru_ru: Примечание. Описание формата экспорта в текстовый файл находится в разделе Формат текстового экспорта и импорта.

source: Note: Do NOT modify any of the preferences in the pwsafe.cfg file manually, as this may cause unexpected or unpredictable results.
ru_ru: Примечание. Не рекомендуется изменять файл настроек вручную, т. к. это может привести к непредвиденным результатам.

source: Note: Format '2' is the output from the ANSI C function 'asctime' and format '3' conforms to the ISO 8601 standard.
ru_ru: Примечание. Формат 2 является выводом ANSI C функции «asctime», а формат 3 соответствует стандарту ISO 8601.

source: Note: If a Group name is selected and then a new entry added, that entry will have that Group name prefilled in the Edit/View Entry dialog.
ru_ru: Примечание. Если при создании нового элемента была выбрана группа, её имя автоматически помещается в поле «Группа» диалога Редактирование/просмотр элемента.

source: Note: If you are having problems with AutoType, you might want to disable 3rd-party popup-blockers.
ru_ru: Примечание. В случае возникновения проблем с автонабором попробуйте отключить блокировщики всплывающих окон

source: Note: If you are having problems with autotype, you might want to disable 3rd-party popup-blockers.
ru_ru: Примечание. В случае возникновения проблем с автонабором попробуйте отключить блокировщики всплывающих окон

source: Note: If you do not have a YubiKey, the screen shown above will not have the YubiKey button and text displayed.
ru_ru: Примечание. Если у вас нет YubiKey, соответствующие кнопки и поля не будут отображены.

source: Note: If you do not have a YubiKey, then the YubiKey buttons will not be displayed, and you can ignore the description of their use below.
ru_ru: Примечание. Если у вас нет YubiKey, соответствующие кнопки не будут отображены, и вы можете пропустить описание их использования.

source: Note: If you use this dialog to delete these files, they will be sent to the Recycle Bin, if your version of Windows supports it on the media containing them.
ru_ru: Примечание. При удалении файлов из этого диалога они перемещаются в корзину, если диск и ОС поддерживают данный функционал.

source: Note: If you're using a "single sign-on" system that allows you to share the same password across different machines/servers/applications, etc. you can setup Password Safe entries accordingly, so that changing one password affects all other related entries.
ru_ru: Примечание. Если вы используете системы «единого входа», которые позволяют использовать один и тот же пароль для различных машин/серверов/приложений, то можно настроить несколько элементов Password Safe таким образом, чтобы изменение пароля в одном из них автоматически отражалось в остальных.

source: Note: It is strongly recommended that you make frequent backups of your password databases.
ru_ru: Примечание. Настоятельно рекомендуется делать резервные копии контейнеров как можно чаще.

source: Note: Since deleting a row is permanent, you might wish to disable it instead.
ru_ru: Примечание. Так условие удаляется навсегда, в некоторых случаях удобнее отключить его, а не удалить.

source: Note: Synchronize will only be allowed if all selected entries are in also the current database.
ru_ru: Примечание. Синхронизация доступна только если все выбранные элементы присутствуют в текущем контейнере.

source: Note: The Export and Import to/from text files feature has been changed in V3.06.
ru_ru: Примечание. Некоторые параметры текстового экспорта и импорта были изменены в версии 3.06.

source: Note: The Merge, Compare and Synchronize operations may take a long time, especially for large databases.
ru_ru: Примечание. При работе с большими контейнерами операции слияния, сравнения и синхронизации могут занять значительное время.

source: Note: The Password Policy Tab has been superceded by the following menu item to manage the database default policy and named password policies.
ru_ru: Примечание. Вкладка «Политика создания паролей» была заменена следующим пунктом меню.

source: Note: The entry is not actually modified until you click on the OK button in the Edit/View Entry dialog box.
ru_ru: Примечание. Фактически история паролей очищается только после нажатия на кнопку «OK».

source: Note: The exported text is an unprotected copy of the specified password entries.
ru_ru: Примечание. Экспорт в текстовый формат приводит к созданию незащищённой копии указанных элементов.

source: Note: The name cannot exceed 255 characters in length.
ru_ru: Примечание. Имя политики должно быть не больше 255 символов.

source: Note: The padlock graphic in the uper left corner indicates whether or not the "Secure Desktop" feature is enabled.
ru_ru: Примечание. Изображение замка в левом верхнем углу показывает, включён ли «Защищённый рабочий стол».

source: Note: These images are always displayed in the Tree view.
ru_ru: Примечание: В древовидном списке значки отображаются всегда.

source: Note: This menu item will only be enabled if there is no database currently opened.
ru_ru: Примечание. Данный пункт меню недоступен, если в Password Safe открыт контейнер.

source: Note: Unchecking this checkbox will not clear the history.
ru_ru: Примечание. Снятие флажка не приводит к очистке истории.

source: Note: User names and passwords can also be copied to clipboard through the choices located in the Edit menu, but let's be honest, that's far too much clicking.
ru_ru: Примечание. Имя пользователя и пароль также могут быть скопированы в буфер обмена через меню Правка.

source: Note: Variables will be substituted by their values default unless the Ctrl key is pressed down when selecting this menu item.
ru_ru: Примечание. Значение переменных не будет подставлено, если при выборе пункт меню был нажат Ctrl.

source: Note: Windows environment variables are not case sensitive.
ru_ru: Примечание. В ОС Windows переменные окружения регистронезависимы.

source: Note: You can also 'import' a subset of entries from another Password Safe database, by opening the other database with Password Safe (assuming you permit multiple instances via "Manage → Options → System" tab).
ru_ru: Примечание. Чтобы импортировать элементы из другого контейнера Password Safe, запустите ещё одну копию Password Safe (должен быть разрешён запуск нескольких экземпляров на вкладке Сервис→Настройки→Система) и откройте нужный контейнер.

source: Note: each entry may override this value.
ru_ru: Примечание. Данное значение может быть переопределено в свойствах элемента.

source: Note: ince deleting a row is permanent, you might wish to disable it instead.
ru_ru: Примечание. Так условие удаляется навсегда, в некоторых случаях удобнее отключить его, а не удалить.

source: Note: that the XML schema requires the Title and Password fields, hence these cannot be deselected.
ru_ru: Примечание. По XML-схеме требуется, чтобы присутствовали поля «Заголовок» и «Пароль», поэтому их нельзя убрать из списка экспортируемых.

source: Note: these images are always displayed in the Tree view.
ru_ru: Примечание. В древовидном списке значки отображаются всегда.

source: Note:
ru_ru: Примечание.

source: Note:There appears to be an issue using the new AutoType Dragbar image with Internet Explorer (tested with V7, V8 & V9) in that any characters typed before the first tab character are lost.
ru_ru: Примечание. Похоже, что в Internet Explorer (V7, V8 и V9) автонабор с панели «Dragbar» работает не совсем корректно: теряются символы до первой табуляции.

source: Note:There appears to be an issue using the new Autotype Dragbar image with Internet Explorer (tested with V7, V8 & V9) in that any characters typed before the first tab character are lost.
ru_ru: Примечание. Похоже, что в Internet Explorer (V7, V8 и V9) автонабор с панели «Dragbar» работает не совсем корректно: теряются символы до первой табуляции.

source: Note: Group names can be "nested," placing a group name within/under another group name.
ru_ru: Примечание. Для создания вложенной группы добавьте новую группу находясь внутри родительской группы.

source: Note: There is no mechanism within Password Safe to retrieve lost or forgotten safe passwords.
ru_ru: Примечание. В Password Safe не существует механизма для восстановления потерянных (забытых) мастер-паролей.

source: Note that this is a convenient way to support autotyping for applications that require a second password or other arbitrary text as part of the authentication process.
ru_ru: Примечание. Таким образом возможен автонабор для приложений, требующих во время аутентификации ввод второго пароля или произвольного текста.

source: Note: If this filter is active, as it is based on displaying entries in the database found during the last Find operation and only these, i.e. the Find operation is not redone should the database be changed.
ru_ru: Примечание. Т.␣к. фильтр учитывает элементы, которые были отобраны при выполнении последней операции поиска (поиск не выполняется повторно), список отображаемых элементов не изменится, если после этого элементы были изменены.

source: Notes: Free-form general notes field
ru_ru: Заметки: произвольные заметки для данного элемента;

source: Password Expires on: To set a password expiration date, specify the desired expiration date, either as an absolute date (e.g., "March 17th 2007"), or relative from today (e.g., "30 days from now").
ru_ru: Пароль истекает: для указания даты истечения пароля нажмите кнопку «Задать» и введите желаемую дату в абсолютном («22 декабря 2010») или относительном («через 30 дней») формате.

source: Password History: It is possible to configure Password Safe to save the last few passwords of an entry.
ru_ru: История паролей: Password Safe может сохранять несколько предыдущих значений пароля.

source: Password Safe Format
ru_ru: Формат Password Safe

source: Password Safe Preferences
ru_ru: Настройки Password Safe

source: Password Safe allows users to store all passwords in a single "safe" (password database), or to create multiple databases for different purposes (e.g., one for work, one for personal use).
ru_ru: Password Safe позволяет хранить все пароли в одном или нескольких контейнерах (например, один для рабочих записей, другой — для личных данных).

source: Password Safe allows you to define filters and display only those entries that match a given filter.
ru_ru: Password Safe позволяет определить фильтры и отобразить лишь те элементы, которые удовлетворяют заданным в них условиям.

source: Password Safe allows you to define filters, and display only those entries that match a given filter.
ru_ru: Password Safe позволяет определить фильтры и отобразить лишь те элементы, которые удовлетворяют заданным в них условиям.

source: Password Safe allows you to define filters, and display only those entries that matches a given filter.
ru_ru: Password Safe позволяет определить фильтры и отобразить лишь те элементы, которые удовлетворяют заданным в них условиям.

source: Password Safe allows you to define key sequences (shortcuts) that perform specific operations in the application.
ru_ru: Password Safe позволяет определить комбинации клавиш (горячие клавиши) для выполнения различных действий внутри приложения.

source: Password Safe allows you to export password entries to text files.
ru_ru: Password Safe позволяет произвести экспорт элементов в текстовый формат.

source: Password Safe allows you to import password information from other formats.
ru_ru: Password Safe позволяет импортировать данные о паролях из файлов других форматов.

source: Password Safe allows you to keep the last few passwords that were used with a given entry, along with the date that they were set.
ru_ru: Password Safe может сохранять некоторое количество предыдущих паролей (и дату изменения) для данного элемента.

source: Password Safe allows you to manage your old passwords and to easily and quickly generate, store, organize, retrieve, and use complex new passwords, using password policies that you control.
ru_ru: С помощью Password Safe вы сможете как управлять ранее созданными паролями, так и с лёгкостью создавать, хранить, упорядочивать, восстанавливать и использовать новые сложные пароли, удовлетворяющие заданным правилам сложности.

source: Password Safe allows you to search for entries with a given text.
ru_ru: Password Safe позволяет производить поиск элементов по заданному тексту.

source: Password Safe and the Twofish encryption algorithm it uses were originally developed and released to the public by Bruce Schneier and Counterpane Labs.
ru_ru: Password Safe и использованный в нём алгоритм шифрования Twofish разработаны и опубликованы Брюсом Шнайером (Bruce Schneier) и Counterpane Labs.

source: Password Safe can export (and import) the database entries to this format.
ru_ru: Password Safe может экспортировать и импортировать содержимое контейнера в данный формат.

source: Password Safe can import XML files that were generated according to the schema defined in the file pwsafe.xsd, which is provided as part of the distribution.
ru_ru: Password Safe может импортировать XML-файлы, соответствующие схеме pwsafe.xsd, распространяемой вместе с Password Safe.

source: Password Safe can work with a YubiKey device to provide "two factor authentication", that is, protecting your database by both something you know (your "Safe Combination" or master passphrase), and something you have (the YubiKey device).
ru_ru: Password Safe может использовать устройство YubiKey для обеспечения «двухфакторной аутентификации», в этом случае ваш контейнер защищается с помощью того, что вы знаете (мастер-пароль) и того, чем вы владеете (устройство YubiKey).

source: Password Safe cannot directly import a XML file exported by KeePass V1 or V2 as the fields are too different.
ru_ru: Password Safe не может напрямую импортировать XML-файлы, созданные KeePass V1 и KeePass V2, т. к. их формат сильно отличается от используемого в Password Safe.

source: Password Safe cannot import any file created by KeePass V2 - even the KeePass V1 CSV format available from this program.
ru_ru: Password Safe не может напрямую импортировать файлы, созданные KeePass V2 (даже файлы экспорта в KeePass V1 CSV из KeePass V2).

source: Password Safe defines preferences as security-related or non-security related.
ru_ru: Настройки в Password Safe делятся на «связанные с обеспечением безопасности» и «не связанные с обеспечением безопасности».

source: Password Safe generate a report at the end of the import operation, summarizing what was done and noting any problems that may have occurred.
ru_ru: По окончании операции импорта Password Safe создаёт отчёт, содержащий информацию о выполненной работе и возникших проблемах (если такие были).

source: Password Safe generates a report at the end of the import operation, summarizing what was done and noting any problems that may have occurred.
ru_ru: По окончании операции импорта Password Safe создаёт отчёт, содержащий информацию о выполненной работе и возникших проблемах (если такие были).

source: Password Safe has no 'back door' or 'recovery password' mechanism by design.
ru_ru: Password Safe не содержит «чёрного хода» или «пароля для восстановления».

source: Password Safe has a built in check for what it considers to be weak master passwords.
ru_ru: Password Safe имеет встроенные средства проверки сложности мастер-пароля.

source: Password Safe has a number of preferences, each with a reasonable default value.
ru_ru: Настройки в Password Safe имеют предопределённое «значение по умолчанию».

source: Password Safe is freely available and distributable under the restrictions set forth in the standard Open Source Initiative (OSI) "Artistic License 2.0." A copy of this license is included with the Password Safe installation package in the file named LICENSE.
ru_ru: Password Safe находится в свободном доступе и распространяется с учётом ограничений установленных Open Source Initiative (OSI) «Artistic License 2.0». Копия лицензии (на английском языке) включена в поставку Password Safe и находится в файле LICENSE.

source: Password Safe is now an open source project hosted at sourceforge.net.
ru_ru: Сейчас Password Safe является программным обеспечением с открытым исходным кодом и размещается на sourceforge.net.

source: Password Safe only saves password changes.
ru_ru: Password Safe отслеживает только изменения пароля.

source: Password Safe provides several mechanisms for using stored names and passwords.
ru_ru: Password Safe предлагает несколько способов использования сохранённых имён пользователей и паролей.

source: Password Safe shortcut setting does not recognise the difference between the Alt, Ctrl and Shift keys on the left side of the keyboard from those on the right.
ru_ru: Password Safe не различает правые и левые клавиши Ctrl, Alt и Shift.

source: Password Safe supports exporting (and importing) of the stored passwords to (and from) various formats.
ru_ru: Password Safe поддерживает экспорт и импорт сохранённых паролей из различных форматов.

source: Password Safe treats an index that equates to zero as meaning the entire field.
ru_ru: Password Safe считает нулевой индекс соответствующим значению всего поля.

source: Password Safe works very hard to make sure you password information is saved properly.
ru_ru: Password Safe прилагает все усилия для того, чтобы корректно сохранить информацию о ваших паролях.

source: Password: The password
ru_ru: Пароль: пароль;
